# -*- coding: utf-8 -*-
"""Анализ спроса на товары_кривая спроса.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1yEPDAPL3uI2PjfMUySje96PFrK3motJW

Задача определения переменных спроса и представлении функции спроса на товар в виде зависимости от факторов:
Q = f(P, I, A)
где Q - спрос
P - стоимость товара
I - доход потребителей
A - реклама

Для решения поставленной задачи, было принято решение проанализировать площадку Авито среди конкурентов.

*  Для спроса был взят показатель просмотров объявлений
*  P - Стоимость товара - стоимость товара, которую указал продавец в объявлении
*  I - доход потребителей, ср. доход жителей по региону, где размещено объявление
*  A - реклама: кол-во комментариев у продавца (будем считать это рекламой продавца)
"""

import time
import pandas as pd
from sklearn.linear_model import LinearRegression
import matplotlib.pyplot as plt
import os
from sklearn.metrics import r2_score, mean_absolute_error
import seaborn as sns

data = pd.read_csv('/content/ethno_jewelery.csv', index_col = None)

data.shape

"""Данные взяты с сайта Авито по запросу "Этно украшения"
"""

data.head()

data.info()

"""Одной из переменных в нашей формуле является ср. доход покупателей. Чтобы получить данный параметр, мы пропишем ср. доход по регионам. Для этого создадим словарь, где ключом будет - город, который указан в объявлении, а значением - ср. доход граждан
Данные по цифрам взяты с ресурса: https://visasam.ru/russia/rabotavrf/zarplata-po-regionam.html
"""

cities = data.city.unique()
average_income = {}

for city in cities:
  average_income[city] = 0

average_income.update(dict.fromkeys(["Махачкала", "Кизляр", "Дербент", 'Левашинский р-н', 'Каспийск', 'Хасавюрт',
                                     'г.о. Хасавюрт','Ахтынский р-н', 'Карабудахкентский р-н', 'Республика Дагестан, Махачкала, пр-т Али-Гаджи Акушинского'], 50845))
average_income.update(dict.fromkeys(['Уфа', 'Сибай', 'Стерлитамак'], 66868))
average_income.update(dict.fromkeys(['Москва'], 156427))
average_income.update(dict.fromkeys(['Клин', 'г.о. Истра', 'Королёв', 'Химки', 'Сергиево-Посадский г.о.', 'Черноголовка', 'Московская обл., Богородский г.о., рп. Обухово, ул. Энтузиастов, 9', 'Богородский г.о., рп. Обухово'], 99934))
average_income.update(dict.fromkeys(["Казань", "Альметьевский р-н"], 73746))
average_income.update(dict.fromkeys(["Санкт-Петербург", "Выборгский р-н", "Всеволожский р-н"], 82430))
average_income.update(dict.fromkeys(["Ижевск"], 67592))
average_income.update(dict.fromkeys(["Псков"], 57125))
average_income.update(dict.fromkeys(["Воронеж"], 63879))
average_income.update(dict.fromkeys(["Петрозаводский г.о."], 80444))
average_income.update(dict.fromkeys(["Смоленск", "Рославльский р-н"], 61617))
average_income.update(dict.fromkeys(["Астрахань", "Астраханская обл., Астрахань, ул. Рылеева, 90"], 64331))
average_income.update(dict.fromkeys(["Бахчисарайский р-н", "Симферополь", "Севастополь"], 58730))
average_income.update(dict.fromkeys(["Нальчик", "Баксан"], 53661))
average_income.update(dict.fromkeys(["Пенза"], 57838))
average_income.update(dict.fromkeys(["Улан-Удэ"], 79954))
average_income.update(dict.fromkeys(["Пермь", "Чайковский г.о."], 74984))
average_income.update(dict.fromkeys(["Екатеринбург"], 80217))
average_income.update(dict.fromkeys(["Боровский р-н", "Сухиничский р-н"], 74431))
average_income.update(dict.fromkeys(["Тамбов"], 56543))
average_income.update(dict.fromkeys(["Волгоград"], 60653))
average_income.update(dict.fromkeys(["Краснодар"], 96026))
average_income.update(dict.fromkeys(["Тюмень"], 86741))
average_income.update(dict.fromkeys(["Иваново"], 52341))
average_income.update(dict.fromkeys(["Челябинск"], 70953))
average_income.update(dict.fromkeys(["Кострома"], 52761))
average_income.update(dict.fromkeys(["Владимир"], 59732))
average_income.update(dict.fromkeys(["Архангельск"], 74121))
average_income.update(dict.fromkeys(["Новомосковск"], 63542))
average_income.update(dict.fromkeys(["Рязань"], 60732))
average_income.update(dict.fromkeys(["Саратов"], 57321))
average_income.update(dict.fromkeys(["Барнаул"], 58341))
average_income.update(dict.fromkeys(["Черкесск"], 52541))
average_income.update(dict.fromkeys(["Самара", "Сызрань"], 70321))
average_income.update(dict.fromkeys(["Оренбург", "Соль-Илецк"], 60452))
average_income.update(dict.fromkeys(["Омск"], 65832))
average_income.update(dict.fromkeys(["Отрадненский р-н"], 58241))

data['average_income'] = data['city'].apply(lambda x: average_income[x])

"""Наши данные могут содержать выбросы, такие как: очень высокое кол-во просмотров или слишком завышенная цена (например, для привлечения покупателей). Просмотрим boxplot этих показателей"""

sns.boxplot(data['price'])

sns.boxplot(data['views_cnt'])

"""Убираем выбросы, такие как: число просмотров > 5000 и цена товара >2000"""

data = data[(data['average_income'] != 0) & (data['price'] <= 2000) & (data['views_cnt'] <= 5000)]

data.info()

"""Для построения расчетной регрессионной функции, будем применять линейную регрессию"""

model = LinearRegression()

X = data[['price', 'average_income', 'comments_cnt']]
y = data['views_cnt']

plt.scatter(X['price'], y, alpha = 0.5)
plt.grid()
plt.xlabel('Стоимость товара, руб.')
plt.ylabel('Кол-во просмотров')
plt.title('Зависимость кол-ва просмотров от стоимости товара')
plt.show()

"""Построим расчетную прямую спроса только по 1 критерию: цена"""

X_price = data[['price']]

model.fit(X_price, y)

model.coef_, model.intercept_

"""Получает следующую зависимость
Q = 834.16 - 0.46 * P
Построим график и посомтрим на функцию
"""

sorted_idx = X['price'].argsort()
X_sorted = X.iloc[sorted_idx]
y_pred = model.predict(X[['price']])
y_sorted_pred = y_pred[sorted_idx]
print('R2 score: ', r2_score(y, y_pred))
print('MAE: ', mean_absolute_error(y, y_pred))

plt.scatter(X['price'], y, alpha = 0.5, label = 'Исходные данные')
plt.plot(X_sorted['price'], y_sorted_pred, color = 'red', linewidth=2, label = 'Регрессионная прямая')
plt.xlabel('Стоимость товара')
plt.ylabel('Кол-во просмотров')
plt.title('Зависимость числа просмотров от цены')
plt.grid()
plt.legend()
plt.show()

"""Добавим остальные параметры в наш алгоритм и найдем оставшиеся переменные"""

model.fit(X, y)
y_pred = model.predict(X)
print('r2 score: ', r2_score(y, y_pred))
print("mae: ", mean_absolute_error(y, y_pred))

model.coef_, model.intercept_

"""Таким образом, наша функция имеет следующий вид: **Q** = 966,642 - 0.389**P** - 0.002**I** + 0.546**A**"""

X['price'].mean(), X['average_income'].mean(), X['comments_cnt'].mean()

"""Расчитаем по нашим данным эластичность спроса по ценовым и неценовым факторам
формула для расчета:

![image.png](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAALcAAABQCAYAAABbL+SlAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsMAAA7DAcdvqGQAABJ4SURBVHhe7Z0HkBRFFIYbEEFRCeYsEkS0VETwAEULQckgJlQkGLAMoIJiIpxACQqICBQZFMyKihgxoBQmjEhQMWAABZWkiKBo299j+lyW3bvd2dm7naH/qq2729m9u5n5+/X//ve6t5Q2UA4OEURp76uDQ+TgyO0QWThyO0QWjtwOkYUjt0Nk4cjtEFk4cjtEFo7cDpGFI7dDZOHI7RBZOHI7RBautyTH8O+//8oDlCpVSpUuXVq+OqQPR+4s4eeff1Y//PCD+vvvv9U///yjDjnkEHX44Yd7R7cHt2DdunXq+++/L3jwnt12203VrFlTVa9eXR144IGqTJky3jtyH7/99pv67rvv1NatW71nEqNs2bJq7733Vvvss498HyQcubOERx99VI0ePVp9/fXXasuWLeree+9VXbp08Y7+D27+vHnz1Isvvqi++uortf/++8uDaP3rr7+qTz/9VB100EHqyiuvVI0bNw4NwT/88EN19913yzkwWP/66y9VpUoVITKzEeDcuTZHHnmkOu2009TZZ58tx4OCI3eWQNR655131Lhx4+Tmzpw5U5144one0W1Yv369Gj9+vJo9e7Y69thjVadOneQ1FSpUkON//vmnevnll9WQIUOE1KNGjVL16tWTY7kOzm3ZsmXqxx9/VL1791abN29W3bp1U02bNi0YoJCb6/Twww+rzz77TF144YWqX79+as8995TjGQNyOwQPo5v1u+++q/Py8rSJSvqnn37yjmyDiWi6V69e+oADDtA9evTQK1eulPfEY9OmTXrEiBHayBrdpk0bbUjjHQkHTASXc6xTp45+7bXXdjhHI9v0Qw89pI1k02bG0nPmzPGOZA7nlmQJJIVo7lWrVqm6detuF402btyo7rnnHmVuqjrhhBNUfn6+SI9EiSO6u379+qpy5coiX9577z3vSDiAPPnjjz/UwQcfLDlH/Dnusssucm58ZaZ6//33vSOZw5E7S2AaXrp0qfr9998lKdx1113leabil156ST311FOqYsWKauTIkaJFC8O+++4rJGfALFiwQBLQMICk+K233pJEEWKTNMaDc/rmm2/kegEGeVBw5A4IRCfI/Oabb6pFixaptWvXSoK43377qaOOOkoiE6T89ttvRWMS0S+66CJVo0YN7zckx+677y4PYB2YMOCXX36RSMz/fvTRRxfkErHYsGGDXC+i9qGHHqpOOeUU70jmcOTOEEQebg4yY+rUqcroSjVmzBhxSj766CO5YUZzynRsI5nR4mLtkVxZ56AwcONxFUCYfG8SSpNrqL322kvIzQCPBbMY14LZiNmrb9++4pwEBUfuDAGxb7nlFrHs2rVrp2644QZ1wQUXiPTAKahWrVqBvQVJX331VdHcJ510khxLhagm2RTfGGATxpMkV/HBBx8IgZFVnGssmOmeeeYZNWzYMHFPcEnat2+f0mBPFY7cGWD16tVicxGd8KEbNmwoyRGe7amnnio6mwKMTSbxfInmkJNIlorlRbTHK2dAgOOOOy4UkRvyEpEBNh/Exca0D64PFmdeXp6aMmWKBITy5cvL64OCI7dPoJ/xsCErbgY3yfq3RB80NREbTV2uXDl5Hr+byiUaFPfAPl8YiNj8Db6SbPF3wgDO84svvpBrctVVV0mRCj/fPubMmSPkv/POO2XApnIt0oUjt0+gJ6lCEm1IgvbYYw/viBJiE62QEEccccQOkZbXEuGLmoIZQDgJJKp8TwKKVg8DPv/8cynkMEs1atRI8o7YB86JDQbZgiO3T3z88cdy8yAqXnUslixZIk4ByWQsGbnR6WhKNPr8+fPVl19+KRXMSy65JBSSBJ1tHRBIXKtWLe9I8cKR2ydIFtHD8QQG2IFEJSxA7C8SQnxcZAoRGysP98P61fRdMBMQpfkecIxpnaSL911//fXqsMMOk2O5DiQUsw3nePzxx4sdWhJw5PYJO6Vy46wHDUj8sPsg9THHHCPac9KkSWrNmjUyCOgdsR1zEHnTpk3qjjvuECuRBOuJJ54QUjAr0GzFwOjevbs666yzsj6NBwVkme1sbNasWVb0dCpw5PYJrC0rM6xUINq+8MILIlnwdoncVi/jjCBhzj//fPn+9ddfFxLQDEX1EWJjI1L44UESxgxw2WWXSTdhrKbPZXCu1t+G1HXq1PGOFD/K5NPY4JA20JL0TaCvTz75ZImqzz77rJo2bZoUdvgZa5BeEDQ5UZzBgIxhQOAYLF68WJwQbDAST96HDCGSE7lpGYXY1iLLZb2N7OL8yRE4BzQ35Kbsvnz5cvk+yHbWVBBYyyueLxEnHUAAmvixuNJJtHIF6O6BAwfKueNpcyOvueYaeR5iAoo1l19+uTgnFkgRWmB5MH3jHjATIGEofLRq1UoNGDBAyMDtoWQPwXldrhKc86CYxbnFg1mMQXrGGWd4zxQPAiP3k08+WaAtuUn8WohbqVIl7xXbgLnPdEwmzfTcs2dPdemllxY0FoUN6ErOBdJBQKuL0c24BkQsInYiEJ2J3hR3aC7ieuCdI2f69+8vA56B8/jjj0vRg+QsDG5JriAwcjNySX4w58eOHSs3iqgW3xgEEbiZvI5G/Ntvv12a2JMRYGcCS8169Oghmp3GfZwVGo8o+Fx33XUl5jqEFpA7KNBYb6ZjbaK1NNabqOMd2RE0sTdp0kSbiJ+wSX9nxIYNG7QZ6HL9DJG1IbU2el0/99xz2swC3qscUkWgQpekgsoUUzUJVKxFFg9sMfqciUZuqt0GHBGkB1KGGQ5ZgmTDTguLDZhLCJTc6G3cAzze2rVry02yYMolMbJFCgYC7kBRjfo7EyAzDVj33XefJJQknFiCmeYj6H8cC9tZmAwm2IlkxIMPS894YQiU3FwUmulxBnAOrI4mscLXpUmflSmA5IsoVdz2UK6D64IXTrch3XNB5CIUlqZPny7JKkEmESD2ihUr5DWYAyT+YUeg5F64cKGQF1sLPxe5wUUj2XzjjTckQbKrMbC14i0yh+yAAMLKeizKQYMGiZsVD56bPHmy3C8GV7zLFUYE5pYgNzp37iwVOohLs4yVJUQLIgEN6c2bNw/c02ap0ty5c8U28wMGHJ1riTr4ogQiM/47ORFWow0s3B9kEIRGFiVbrBw2BEZuvOvTTz9diEYRgr5jSEzrJ5UrZAqLYUk0gwbrFVlJThEpldNhquf/sLMI5W/KxHa2iTLQ3Vi05DwQmmtB2Z/oTvCJQsS2CIzcaGp2DGIN3IgRI1STJk3keZJGihCUZan02xXQuAE4AGEs3vC/k6SVFCj42IHpBySNEJwIDtkh9tChQwvK/H5AUAuISsKJwpy2VBEIuSHw4MGDhdRM7yyQtQs9uYAPPvigOCnXXnut/ONEDRImLC6WH4UNEyZMULNmzfJ+Kn4wKyIr/IJbziqYW2+9VX6mshy/xjFdENiCGvAExhtvvNH7yT8CITdJ5Lnnnit9ER07dpQON/oJAMSnymbdEcDmMnTDUclEnzsUL3C02MaN8j+EpAJKT0zUKqCBkJum+jPPPFMsv9tuu0282WRJIxf06quvlqVZJC+8ByeFHovWrVvLIGC9HYOiRYsWKSV5ZPpYXbgyfkDxhBmEJqegk91cA/kJsyyy5oorrpAoTpDBECCSR8m9CoTcjzzyiIx8CjK0fNLkkwgQFomCbKEpnySTlk8GB8UfSM5eHi1btpRZgOdJchLtVBQLNDBbKzBw/JwOA4rV6FGvliINuU9c9169ehWcL0vimEmZgen1iUwEh9yZwIx4ffPNN+uKFSvqBg0a6BUrVnhHtgevmzFjhq5Zs6bu27ev9JMYUuqZM2fqt99+W5uIr2vVqqWXL18ux+bOnSu/zySi3m8oHLwnk0fUYYitjWTUPXv2lB6geJjEUpvIrU0uJJt0RgG+IjdvQbcRaVlx8cADD4iHSgcgfbuxZXfAa/C/icREd5rZ0d9IErxpQy5JNuk3YYrERXn++eeVGTQyhYYx6cSFwD8moeaBxcbmNBZcQ2YaW7EtDFxPuiz9Ogg4Gbgh/E2uZ7KqJ3Yudi0anBVAmTgyseA+8z8gH1nsjFvDjMGaUPZ1QQpl4tQkgy9yQ0aSQiQI/3g6YBU3i13xli1otqLF86abbpLtC9B/lIHZnoy/Eb+vdRiAVGNdpF0riZMEYSy4biR19I9Q4EIaQDpsudgbzXshNlKPvIZrkW5JnkFEGy0rgqgSFwaqmPzP7CUSBLk5L2xi2pshN0Tm99K7wmZDLG7AhOBRlPxMG5C7pDFr1ixtIrleunSp/EyrrEl2dOfOnWU6DSOWLVump0yZohs2bCh7Ty9YsMA7sg0mmmszqLVJnnWfPn20IbCuW7euNoTXZpYreDz22GPaDHptEmtdr149/corr4RCRvE/mgGlu3fvruvXr6/vuusuOV/247bHTRTXZsYWqTpo0CC9efNmORYUSpzcW7Zs0fn5+dokdKK3OXn6l8877zy5kZAgrIDQjRo10ibqyubyyWCkgpC7a9eu2kRO79n/YaKf7tSpk+Q1bdu21SYCekdyE9wz8qjmzZtrIz1kgG7cuNE7+j8g+MKFC3XTpk0lADCYg0SJ+15oMavFWYNHto4mZzsDpuKwWnPobPIQ8g1K++zFnQj4zLYOgP5M9DpkCVM2OhUJh3TIZeBcUQFlcTRVaXKmRBKH86F4hFSlc5HiWKI1mH5R4sxhaRoEYBnV/fffL0kkWhRLMD4xDROowrKtA3qXRRnJPqmL5IrXkXCSkCdKrLjh6GByHfR2bL6Sa+B8qHjyeUDkUWY2KrTFgmMYCVyfTz75JGHHol+UKLm5WTTRg6pVq8qNJYKHcdUJZKaIxJYGLMpgRqKRC4ck0d7UFrQJ4xjhLRPFEs1UXCPIbWZamc1YeJ2LIElki2aKcHQWduvWrci6AaTmnnN9CASRIDduASOVLBpHgGw+WSN9LoMBir1FLzQraPiK7YbLwzlBRFoMEpEW6cLuVBAA+41HPLAUIQs2HQ4GRZggmoqyAaqfTz/9tBSL6BBFZhUFrgFuEdexqIGQLkpclhCJKMejNYlMYQMamE8EMMmvNILxPW0DWIFEcqJxMosLnWkSL5makS6x7aZcCzT7xIkTZTdZdDu92NloGQ4KXAs+KYG+IjYkSsVKtDMeuQeDNtCWW7JKB3/AxWjXrp3YmLNnz5YqLMDxwco0UkN2A0hUEQRGwmijN2W1u0mqxF0wA0MefM9H/JkBo0eNGiXWYq47R8OHD9eG2GL9mWQyJcuSinaHDh3kfXl5eYFavyUeucMKc+1EgtCnTsMVM5BNGskZ0I9oSSJysuobzWL0xRDZ2YSdjS+pEPKg12PGjBkFi4RJNnPdOUJmcl2QYZx7KjKDvMTmE/QUFVVkSgeO3D5BdY22AwhNh2OshUdVDgeEalyyrkbyDKwybiq6nMXA7DRlHwwKVgZhAyZzWnIN6GZAlTWVjTuRJDTOYW2SeFOlDFJ3O3L7hE2A0ZXx7QEQGwcE0mJzJQLvZQkehIjKLgDpuFwMavqTaOPAZWH9bSoJaDpw5PYJbgyZPgSO/2BQbhg3mghM5IXo8atUsAttMQZZE5boXBjs5vjMSrE9Rwxk5AdSDVIDXsOWekRuVt5cfPHF0XNLwgobpdCXsa4ABRd0OM/hbFDUQL5gj1kQrYna2HzIGSRJFIBDghxh0GILApaz0ZNPYYdcgk+PgOBcI5wgojUFPOocQcOR2yfQ0hQeILmNONw0LEEkCxGb7S0gMW2tsd40A4BiD1YgiWIifzuMYAYiCnPO5BMUn7AvzznnHLF7CQSU5qltsLsvlVaIz+BOR9KkCkdun2AhNFvGMa3atlYKGKwfpW0AZ4OEiQ3q0dRENAoxbHNBJEe68B4GCAOCT1FIpbc7l0FSyMJeBjXuDyuukCdszo9kQabxPIkj/j87W1HsyZYkC2SZ2c4KdDer+CEthGZqpTeG4gsRiYjeoEEDiVLocqw9+mYSgeoj609xSMIM6ERCPXz4cJnBqD42btxYrgVRmwFMBbdNmzYSAMhF6C/i+iSzTP3CkTtD2PIxNw/pYadX/GuiFlNvsr6SKINzpy0B75vvyS2wSNnDBj+ffhueZ60sg6FDhw6BbwjkyO1QbKBHpk+fPqLN+XQ2Zjwax2iJpYATtDxxmtuh2MAMRiwlN6EHh2V4OEf0zWRDdztyOxQbbBMZhKa1lSSTj0nJVguvkyUOxQaoRucgLgn962zBls09Uhy5HSILJ0scIgtHbofIwpHbIbJw5HaILBy5HSILR26HyMKR2yGycOR2iCwcuR0iC0duh4hCqf8AMDk+XshFu7wAAAAASUVORK5CYII=)
"""

Ep = -0.389*X['price'].mean()/y.mean()
Ei = -0.002*X['average_income'].mean()/y.mean()
Ea = 0.546*X['comments_cnt'].mean()/y.mean()

print(f'Эластичность спроса по цене: {round(Ep, 2)}')
print(f'Эластичность спроса по доходу: {round(Ei,2)}')
print(f'Эластичность спроса по количеству комментариев: {round(Ea,2)}')

"""**Выводы**

В ходе анализа была выявлена зависимость спроса (в нашем случае — числа просмотров объявлений) от следующих факторов: цена товара, средний доход потребителей (средняя зарплата по региону) и бюджет на рекламу (в качестве данного параметра использовано количество комментариев у продавца).

Для решения задачи применена линейная модель, по результатам которой получено следующее уравнение зависимости:


Q=966.642−0.389P−0.002I+0.546A


Где:

Q — спрос (количество просмотров),

P — цена товара,

I — средний доход потребителей,

A — бюджет на рекламу (количество комментариев).

Исходя из полученной модели, можно сделать следующие выводы:

**1. Зависимость спроса от цены**

Спрос и цена находятся в обратной зависимости: при увеличении цены спрос снижается, что является ожидаемым результатом. Однако расчет коэффициента эластичности спроса по цене показал, что влияние цены на спрос невелико. В частности, при снижении цены на 1% спрос увеличится лишь на 0.47%.

**2. Зависимость спроса от дохода потребителей**

Интересная закономерность наблюдается в отношении среднего дохода: с его ростом спрос на товар снижается. Это можно объяснить тем, что при увеличении доходов потребители переходят в более премиальный сегмент украшений.

**3. Влияние рекламы на спрос**

В отличие от цены и дохода, зависимость спроса от рекламы является прямой и имеет наибольший коэффициент среди всех факторов. Это говорит о том, что в данном сегменте (украшения в этно-стиле) целесообразнее увеличивать бюджет на продвижение, а не снижать цену, особенно если текущая цена находится в среднем диапазоне относительно конкурентов.




"""